z-mnp-test/misc/DealerWsWebService/PortInServiceSoapBinding/portIn/MIW1.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ws="http://ws.dealer.mnp.cat">
   <soap:Header/>
   <soap:Body>
      <ws:portIn>
         <ws:userId>?</ws:userId>
         <ws:password>?</ws:password>
         <ws:customerInfo>
            <!--Optional:-->
            <ws:msisdnCheckSum>2</ws:msisdnCheckSum>
            <!--Zero or more repetitions:-->
            <ws:msisdnInfoList>
               <ws:eq_type>?</ws:eq_type>
               <ws:iccid>?</ws:iccid>
               <ws:msisdn>66897335211</ws:msisdn>
               <ws:msisdn_type>?</ws:msisdn_type>
               <ws:package_id>?</ws:package_id>
               <ws:pincode>?</ws:pincode>
            </ws:msisdnInfoList>
		  
		  <ws:msisdnInfoList>
               <ws:eq_type>?</ws:eq_type>
               <ws:iccid>?</ws:iccid>
               <ws:msisdn>66897335212</ws:msisdn>
               <ws:msisdn_type>?</ws:msisdn_type>
               <ws:package_id>?</ws:package_id>
               <ws:pincode>?</ws:pincode>
            </ws:msisdnInfoList>
            
            <!--Optional:-->
            <ws:orderId>?</ws:orderId>
         </ws:customerInfo>
         <!--Optional:-->
         <ws:cust_type>?</ws:cust_type>
         <!--Optional:-->
         <ws:userlogin>?</ws:userlogin>
         <!--Optional:-->
         <ws:titlename>?</ws:titlename>
         <!--Optional:-->
         <ws:fname>?</ws:fname>
         <!--Optional:-->
         <ws:lname>?</ws:lname>
         <!--Optional:-->
         <ws:titlecompname>?</ws:titlecompname>
         <!--Optional:-->
         <ws:compname>?</ws:compname>
         <!--Optional:-->
         <ws:birthday>?</ws:birthday>
         <!--Optional:-->
         <ws:gender>?</ws:gender>
         <!--Optional:-->
         <ws:language>?</ws:language>
         <!--Optional:-->
         <ws:doctype>?</ws:doctype>
         <!--Optional:-->
         <ws:docnum>?</ws:docnum>
         <!--Optional:-->
         <ws:acctcategory>?</ws:acctcategory>
         <!--Optional:-->
         <ws:email>?</ws:email>
         <!--Optional:-->
         <ws:telno>?</ws:telno>
         <!--Optional:-->
         <ws:vatcode>?</ws:vatcode>
         <!--Optional:-->
         <ws:biltitlename>?</ws:biltitlename>
         <!--Optional:-->
         <ws:bilfname>?</ws:bilfname>
         <!--Optional:-->
         <ws:billname>?</ws:billname>
         <!--Optional:-->
         <ws:biltitlecompname>?</ws:biltitlecompname>
         <!--Optional:-->
         <ws:bilcompname>?</ws:bilcompname>
         <!--Optional:-->
         <ws:bilhousenum>?</ws:bilhousenum>
         <!--Optional:-->
         <ws:bilmoo>?</ws:bilmoo>
         <!--Optional:-->
         <ws:bilvillage>?</ws:bilvillage>
         <!--Optional:-->
         <ws:bilroad>?</ws:bilroad>
         <!--Optional:-->
         <ws:biltumbol>?</ws:biltumbol>
         <!--Optional:-->
         <ws:bilamphur>?</ws:bilamphur>
         <!--Optional:-->
         <ws:bilprovince>?</ws:bilprovince>
         <!--Optional:-->
         <ws:bilpostcode>?</ws:bilpostcode>
         <!--Optional:-->
         <ws:vattitlename>?</ws:vattitlename>
         <!--Optional:-->
         <ws:vatfname>?</ws:vatfname>
         <!--Optional:-->
         <ws:vatlname>?</ws:vatlname>
         <!--Optional:-->
         <ws:vattitlecompname>?</ws:vattitlecompname>
         <!--Optional:-->
         <ws:vatcompname>?</ws:vatcompname>
         <!--Optional:-->
         <ws:vathousenum>?</ws:vathousenum>
         <!--Optional:-->
         <ws:vatmoo>?</ws:vatmoo>
         <!--Optional:-->
         <ws:vatvillage>?</ws:vatvillage>
         <!--Optional:-->
         <ws:vatroad>?</ws:vatroad>
         <!--Optional:-->
         <ws:vattumbol>?</ws:vattumbol>
         <!--Optional:-->
         <ws:vatamphur>?</ws:vatamphur>
         <!--Optional:-->
         <ws:vatprovince>?</ws:vatprovince>
         <!--Optional:-->
         <ws:vatpostcode>?</ws:vatpostcode>
         <!--Optional:-->
         <ws:commercialid>?</ws:commercialid>
         <!--Optional:-->
         <ws:employeeid>?</ws:employeeid>
         <!--Optional:-->
         <ws:channel_id>?</ws:channel_id>
         <!--Optional:-->
         <ws:customer_remark>?</ws:customer_remark>
         <!--Optional:-->
         <ws:customer_type>?</ws:customer_type>
         <!--Optional:-->
         <ws:priority>?</ws:priority>
      </ws:portIn>
   </soap:Body>
</soap:Envelope>